Задание 1.1
Переменной avocado присвойте значение 20, orange - значение 5.7, pear - "Yes".

Решение:
avocado = 20
orange = 5.7
pear = "Yes"

Расскажите какие типы данных были задейсвованы?

Ответ:
str
int
float

Важно: Все задания надо выполнять используя только пройденные ранее уроки.


Задание 1.2
Значение, хранимое в переменной avocado, увеличьте в 2.5 раза.
Полученный результат свяжите с переменной peach.

Решение:
peach = avocado * 2.5

Важно: Все задания надо выполнять используя только пройденные ранее уроки.


Задание 1.3
Измените значение, хранимое в переменной orange,
уменьшив его на единицу, результат свяжите с той же переменной.

Решение:
orange = orange - 1

Важно: Все задания надо выполнять используя только пройденные ранее уроки.

Задание 1.4
Разделите avocado на orange, а затем peach на orange.
Результат данных выражений не привязывайте ни к каким переменным.

Решение:
avocado/orange
peach/orange

Важно: Все задания надо выполнять используя только пройденные ранее уроки.

Задание 1.5
Измените значение переменной pear на "YesYesYesNoNo".
При формировании нового значения используйте операции конкатенации ()+)
и повторения строки (*).

Решение:
pear = pear * 3 + 'No' * 2

Важно: Все задания надо выполнять используя только пройденные ранее уроки.

Задание 1.6
Выведите значения всех переменных.

Решение:
20
4.7
YesYesYesNoNo
50.0
4.25531914893617
10.638297872340425
